[
    {
        "id": 18484556,
        "title": "Solstice Stories And Shadowed Things",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/18484556-solstice-stories-and-shadowed-things.mp3",
        "artwork_url": "https://storage.buzzsprout.com/1pnor27k282b025zctfx7ywgxq7v",
        "description": "<p>The wind has a way of finding the cracks in our certainty, and on this solstice we let it in. We light the room with laughter, pour thick drinks, and tell three stories that bite: a child hears promises the fog won’t confess, iron boots ring down ruined halls, and something skinless drags itself up from the sea, hot breath reeking of graves. It’s a Fae-forward gathering with Sortia, Barnaby the gnome, and Gracie holding the circle while our human co‑hosts wander off the map—until they stumble back with gifts, kaiju time gaps, and a very opinionated tea.<br><br>We start with the Earl King, a warning about the peril of tidy explanations. Believe the children isn’t just kind advice; it’s a survival protocol when the night whispers. Barnaby then profiles the redcap of the Scottish Borders—iron boots, blood-wet cap, speed that laughs at flight—and the one rule that saves you when nothing else will. Finally, the Nuckelavee lumbers in from the northern coasts, all raw muscle and acid tears, stopped only by fresh water. These aren’t museum myths. They’re living hazard maps disguised as stories, teaching us how to read wind, tide, and silence before they turn.<br><br>When the boys crash back through the door, the tone whipsaws—witch hexes on corrupt suits, hemp lattes versus fruity tea, and studio chaos—but the spine holds. We trade folklore as fieldcraft: carry the right words, keep fresh water near, listen when fear names what your logic refuses. If you hike ruins, walk night roads, or love a good chill with your coffee, this one is for you.<br><br>If the shivers hit right—or if you just enjoy two grown men acting twelve while a puka runs the board—tap follow, share this with a brave friend, and leave a quick review. Keep your fires lit, keep your water fresh, and for the love of the old gods, watch the tide.</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2026-01-10T12:00:00.000-05:00",
        "duration": 2326,
        "hq": false,
        "magic_mastering": true,
        "guid": "Buzzsprout-18484556",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 17,
        "season_number": 1,
        "episode_type": "full",
        "explicit": true,
        "private": false,
        "total_plays": 76
    },
    {
        "id": 18121996,
        "title": "Japanese Ghost Stories: From Filth Lickers To Vengeful Spirits — Halloween '25",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/18121996-japanese-ghost-stories-from-filth-lickers-to-vengeful-spirits-halloween-25.mp3",
        "artwork_url": "https://storage.buzzsprout.com/bmoh4hvos2wyp86bpe5aluq9q631",
        "description": "<p>What if the thing you left behind never stopped moving toward you? We pour pumpkin ales, crack a few ridiculous sponsor bits, and then step straight into two of the most unsettling Japanese ghost tales we know—told with care, humor, and zero caricature.<br><br>First, a samurai trades devotion for status and returns years later to a house swallowed by weeds and wind. The scene glows with a single candle, a familiar silhouette, and hair so black it seems to drink the light. Morning peels away the comfort. Regret turns literal as living strands tighten like rope. It’s a gothic gut-punch about the cost of convenience, the weight of promises, and how neglect can outlive us in ways that grasp back.<br><br>Then the fog rolls in and the tempo spikes. We follow three friends to a derelict rail crossing and meet Teke Teke, an urban legend with rules that cut deep. The scrape starts slow. It doesn’t stay slow. This isn’t a ghost you talk down with a charm; it’s consequences at elbow speed. We unpack why the story lands—precision of place, the banality of cruelty, and a monster whose physics make you run before you think. Along the way, we thread in yokai lore like the filth-licker, plus the everyday dread of hair that won’t leave your space, turning the ordinary into the uncanny.<br><br>We keep it warm between chills: boundaries around accents and culture, shoutouts to our community, and a few lines we live by—never whistle at night, fear is the parent of cruelty, choose love. If you’re here for folklore that respects its roots and storytelling that grips without gimmicks, you’ll feel right at home with us.<br><br>If it made you shiver or smile, tap follow, share with a friend who loves horror, and drop a review to help others find the show. What legend should we explore next?</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2025-11-02T23:00:00.000-05:00",
        "duration": 2411,
        "hq": false,
        "magic_mastering": true,
        "guid": "Buzzsprout-18121996",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 16,
        "season_number": 1,
        "episode_type": "full",
        "explicit": true,
        "private": false,
        "total_plays": 60
    },
    {
        "id": 17880820,
        "title": "Listen & Subscribe to the Uncanny Coffee Hour",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/17880820-listen-subscribe-to-the-uncanny-coffee-hour.mp3",
        "artwork_url": "https://storage.buzzsprout.com/ph9a2jzeq0gku425vgp0c5nvnthq",
        "description": "<p>Visit us, subscribe, and be weird! <a href=\"https://www.uncannycoffeepodcast.com/\">uncannycoffeepodcast.com</a></p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "weird, uncanny, strange, yokai, ghosts, bigfoot, sasquatch, ufo, aliens, remote viewing, old west ghosts, yurei, Japanese horror",
        "published_at": "2025-10-17T18:00:00.000-04:00",
        "duration": 69,
        "hq": false,
        "magic_mastering": true,
        "guid": "Buzzsprout-17880820",
        "inactive_at": null,
        "custom_url": "https://www.uncannycoffeepodcast.com/",
        "episode_number": 15,
        "season_number": 1,
        "episode_type": "full",
        "explicit": false,
        "private": false,
        "total_plays": 37
    },
    {
        "id": 17992373,
        "title": "Old West Ghosts",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/17992373-old-west-ghosts.mp3",
        "artwork_url": "https://storage.buzzsprout.com/wor59k5ryqqzrt6391te4ocfjlm9",
        "description": "<p>Ever notice how a building breathes differently after a fresh coat of paint—and how the air seems to carry older voices when the lights dim? We lean into spooky season with a trip through Baker City’s restored Geyser Grand Hotel and along the wind-bitten cliffs below the Heceta Head Lighthouse, weaving jokes, folklore, and lived experience into a single thread: when you revive a place, you often wake the stories sleeping inside it.<br><br>Our path starts in a boomtown where stained glass and mahogany came back to life—and so did the whispers. Room 302 has its gentle guardian who loves rose perfume and “borrows” shiny things, while the kitchen still belongs to a headless chef who won’t surrender his line. In the saloon, the clink of glasses and the shuffle of cards suggest a poker game that refuses to fold. Each account turns the hotel from a museum into a conversation partner, proof that preservation isn’t just woodwork; it’s memory work.<br><br>Then we trade prairie dust for sea spray. At Heceta Head, the haunting feels personal, almost domestic. Locals call her Rue—a keeper’s wife whose loss lingers in tidy gestures and midnight humming. Books find shelves. Glasses migrate to the sink. A window seems to clean itself in a corner with no floor. This isn’t spectacle; it’s a ritual of care against the largest graveyard on earth: the ocean. We talk about why these stories endure, how grief and routine shape space, and where we’re headed next—East Coast battlefields, Día de los Muertos collaborations, and a careful dive into yūrei and yokai.<br><br>If you love haunted hotels, lighthouse legends, and the tender hush of good folklore, brew a cup and press play. Tell a friend who believes, a skeptic who laughs, and someone who’s stayed up late in an old house hearing more than wind. Subscribe, share, and leave a review to help more curious listeners find the show. Where should we go ghost-hunting next?</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2025-10-10T18:00:00.000-04:00",
        "duration": 1838,
        "hq": false,
        "magic_mastering": false,
        "guid": "Buzzsprout-17992373",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 15,
        "season_number": 1,
        "episode_type": "full",
        "explicit": true,
        "private": false,
        "total_plays": 60
    },
    {
        "id": 17879977,
        "title": "Remote Viewing and Non-Local Consciousness",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/17879977-remote-viewing-and-non-local-consciousness.mp3",
        "artwork_url": "https://storage.buzzsprout.com/02s095i3hinxg3itr3ejcfbtbn7y",
        "description": "<p>Have you ever experienced a moment of knowing something you couldn't possibly know? A flash of insight about a distant place or a lost object's location that defies logical explanation?<br><br>The boundaries of human consciousness remain one of our greatest mysteries. In this mind-expanding conversation, we journey into the fascinating world of non-local consciousness and remote viewing—the ability to perceive information about distant or unseen targets using only the mind.<br><br>We share remarkable stories from our own experiences, including unexpected visitors who demonstrated their remote viewing abilities by describing places they'd never been with astonishing accuracy. You'll hear about finding stolen bicycles in a city of 90,000 people through unexplained intuition and instantly locating lost items in the jungle with seemingly supernatural precision.<br><br>The conversation takes an even more extraordinary turn when we discuss dreamwalking—the experience of one person consciously visiting another through dreams. This firsthand account challenges conventional understanding of how minds connect and communicate.<br><br>We also explore famous documented cases of remote viewing, including Ingo Swann's viewing of Jupiter's rings before scientific confirmation and Joseph McMoneagle's work locating a Soviet submarine through psychic means.<br><br>Throughout our discussion, we maintain a balance of openness and healthy skepticism. Are these phenomena truly paranormal, or do they represent natural human capacities we haven't fully understood? The answer might lie somewhere in the quantum entanglement of consciousness itself.<br><br>Whether you're a believer or skeptic, this episode will leave you questioning the true nature of human perception and the possibility that our minds connect in ways science is only beginning to comprehend. Subscribe now and join our community of curious minds exploring the uncanny side of existence.</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2025-09-21T13:00:00.000-04:00",
        "duration": 2429,
        "hq": false,
        "magic_mastering": false,
        "guid": "Buzzsprout-17879977",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 14,
        "season_number": 1,
        "episode_type": "full",
        "explicit": true,
        "private": false,
        "total_plays": 85
    },
    {
        "id": 17733996,
        "title": "Hawaiian Tales: Part One",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/17733996-hawaiian-tales-part-one.mp3",
        "artwork_url": "https://storage.buzzsprout.com/rlo9ifwa2tgtmboeqzr89wqsg90q",
        "description": "<p>The boundary between our world and the supernatural realm has always been thinner in Hawaii. The islands pulse with ancient energy, spiritual power, and stories that send shivers down your spine—even on warm tropical nights.<br><br>Kevin Chang joins us from Oahu to explore one of Hawaii's most enduring supernatural phenomena: the Night Marchers (Huaka'i Po). These ghostly apparitions of ancient Hawaiian warriors announce their presence with pounding war drums and conch shells as they march between sacred sites. The protocol for encountering them is clear: lie face down, avoid eye contact, and show absolute respect—your life may depend on it.<br><br>As a musician, attorney, and community builder, Kevin brings multiple perspectives to this conversation. His work with Kua'a'i Na'ulu A'uamo helps Native Hawaiian communities connect and strengthen their stewardship of natural resources, preserving cultural knowledge that spans generations. Through his band Hoopa Aina, Kevin has captured the mystique of Night Marchers in haunting melodies that both entertain and educate.<br><br>The episode takes an especially chilling turn when we share a firsthand account from a visitor who claims to have encountered Night Marchers at Kapina Falls. Their detailed description—the rhythmic drumming, ethereal torches, and the metallic tang in the air—mirrors centuries of similar reports across the islands.<br><br>Whether skeptic or believer, this exploration of Hawaiian spiritual traditions reminds us that some knowledge exists beyond scientific explanation. The stories we share connect us to our ancestors and teach respect for forces we may never fully understand.<br><br>Have you ever felt unseen eyes watching you in places where history runs deep? Subscribe now and join our community of curious minds exploring the uncanny in all its forms.</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2025-08-25T23:00:00.000-04:00",
        "duration": 1859,
        "hq": false,
        "magic_mastering": false,
        "guid": "Buzzsprout-17733996",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 13,
        "season_number": 1,
        "episode_type": "full",
        "explicit": true,
        "private": false,
        "total_plays": 60
    },
    {
        "id": 17645990,
        "title": "Russian Vodka, Folklore, and the Creatures That Protect Us",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/17645990-russian-vodka-folklore-and-the-creatures-that-protect-us.mp3",
        "artwork_url": "https://storage.buzzsprout.com/uyvla69nyt8udklkwjeaoplcosj1",
        "description": "<p>Deep in the ancient forests and icy lakes of Russia, guardian spirits and monsters have protected the land and its people for centuries. This week, we venture into the mysterious world of Slavic folklore to discover creatures both terrifying and protective.<br><br>The journey begins with Dr. Kitsune sharing a hilariously embarrassing tale from his high school Russian class, where a linguistic misstep with an elderly Russian woman left the entire class in stitches—except for him. His inadvertent use of the informal \"you\" form prompted her to quip, \"My young man, we haven't even slept together yet!\" This moment perfectly captures our blend of cultural exploration and personal storytelling that makes each episode uniquely engaging.<br><br>Saoirse transforms to introduce us to the Leshy, the unpredictable guardian of Russian forests. This shape-shifting spirit can lead travelers astray with eerie whistles or by mimicking the voices of loved ones, creating labyrinths where once familiar paths stood. But there's wisdom in these tales—respect the forest and its keeper, and you might find your way home. The traditional method to break a Leshy's spell? Turn your clothes inside out and put your shoes on the wrong feet to confuse the trickster.<br><br>We then dive into the legend of the Brosno Dragon, a lake monster with a remarkable historical connection. Unlike most cryptids, this creature reportedly saved the city of Novgorod from Batu Khan's invading Mongol army in 1240. When the Golden Horde paused at Lake Brosno, the massive serpentine beast emerged from the depths, creating such terror that the conquerors of nations retreated, interpreting the monster as an omen that the land itself had risen against them.<br><br>Through these stories, we explore how folklore serves as a bridge between humans and the natural world, teaching respect for forces beyond our control while providing protection through cultural knowledge passed down generations. Whether you're fascinated by mythology, cultural traditions, or just love a good monster tale, this episode offers a captivating glimpse into Russia's rich folkloric tradition.<br><br>Listen now, and remember—when wandering in strange woods or beside deep lakes, a little respect for local spirits might just save your life.</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2025-08-09T22:00:00.000-04:00",
        "duration": 1508,
        "hq": false,
        "magic_mastering": false,
        "guid": "Buzzsprout-17645990",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 12,
        "season_number": 1,
        "episode_type": "full",
        "explicit": true,
        "private": false,
        "total_plays": 51
    },
    {
        "id": 17451173,
        "title": "Spirits of the Ancient World: Mayan Alux and Aztec Water Monsters",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/17451173-spirits-of-the-ancient-world-mayan-alux-and-aztec-water-monsters.mp3",
        "artwork_url": "https://storage.buzzsprout.com/3txbd3oa4jcsfi3hpbpsvvqiy147",
        "description": "<p>Step into the mysterious world of Mesoamerican mythology with Dr. Kitsune, Odd Bob, and Saoirse as they explore two fascinating supernatural beings that have captivated imaginations for centuries.<br><br>The journey begins with the Mayan Alush (or Alux), territorial earth spirits no bigger than your knee. These protective beings guard homes and cornfields when properly respected—but turn mischievous when neglected. Through the tale of Mateo, a struggling farmer whose fortunes change dramatically after building a tiny stone house for these spirits, we discover the delicate balance between blessing and curse. When Mateo forgets the ancient warning to seal the dwelling after seven years, his once-helpful guardians begin braiding entire cornfields into impossible patterns and causing chaos throughout his property.<br><br>Then we dive into the terrifying world of the Aztec Ahuizotl, a fearsome aquatic predator with a hand-like appendage at the end of its tail. This cunning monster mimics the cries of a human baby to lure compassionate souls to the water's edge before dragging them underwater to harvest their eyes, teeth, and nails as offerings to Tlaloc, the rain deity. The heart-pounding story of Yolotli, a fisherman who narrowly escapes the creature's clutches, brings this legend vividly to life.<br><br>Between these captivating tales, our hosts share drinks—from jasmine pearl tea to Bloody Marys with locally sourced bacon—and plenty of irreverent banter that makes you feel like you're sitting right alongside them. The episode perfectly balances educational content about Indigenous mythology with the warm, conversational style that makes this podcast so engaging.<br><br>Whether you're fascinated by folklore, indigenous cultures, or just love a good supernatural tale told with wit and authenticity, this episode offers something special. Listen now and discover what ancient warnings we might still need to heed today—and remember, if you hear a baby crying near water, it might not be what it seems...</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2025-07-04T20:00:00.000-04:00",
        "duration": 1652,
        "hq": false,
        "magic_mastering": false,
        "guid": "Buzzsprout-17451173",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 11,
        "season_number": 1,
        "episode_type": "full",
        "explicit": true,
        "private": false,
        "total_plays": 65
    },
    {
        "id": 17374373,
        "title": "The Leannán Sídhe, Creeper Ghosts, and Artistic Sacrifice",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/17374373-the-leannan-sidhe-creeper-ghosts-and-artistic-sacrifice.mp3",
        "artwork_url": "https://storage.buzzsprout.com/c4df02u2rnttfchwf2xp1hgmmoy0",
        "description": "<p>What would you sacrifice for perfect artistic inspiration? The ancient Irish knew this dangerous bargain well through legends of the Lianhan Shee - a fairy muse who grants extraordinary creative vision while slowly draining your life force.<br><br>In this captivating episode, Saoirse weaves the haunting tale of Corvus O'Malley, a technically skilled but emotionally flat painter who encounters this supernatural muse in a storm-swept cave. His bargain transforms his art into something transcendent but at a devastating cost. This story resonates deeply with our hosts' discussion about creative struggles and the sometimes draining nature of artistic pursuits.<br><br>The supernatural theme continues when our guest Erica shares her chilling firsthand paranormal experiences. From mysterious moving pebbles to violently flapping plywood, her encounters in an old farmhouse grew increasingly intense during renovation - suggesting that disturbing these spaces awakened something long dormant. Most unsettling is her friend's encounter with a doppelgänger entity, described by Native American traditions as a shapeshifter that preys on those in weakened states.<br><br>Throughout these stories runs a common thread: our connection to the unseen world often strengthens in moments of vulnerability - during illness, emotional turmoil, or when physical boundaries are disrupted. Whether these experiences are supernatural or psychological in nature, they speak to the universal human experience of sensing something beyond the veil of ordinary reality.<br><br>Have you ever felt inspiration come from somewhere beyond yourself? Or sensed an unexplainable presence in an old building? Share your stories with us and subscribe for more explorations of the uncanny places where folklore, creativity, and the supernatural intersect.</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2025-06-21T17:00:00.000-04:00",
        "duration": 2832,
        "hq": false,
        "magic_mastering": false,
        "guid": "Buzzsprout-17374373",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 10,
        "season_number": 1,
        "episode_type": "full",
        "explicit": true,
        "private": false,
        "total_plays": 82
    },
    {
        "id": 17298515,
        "title": "Tanuki Tales and the Nigawarai Yokai",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/17298515-tanuki-tales-and-the-nigawarai-yokai.mp3",
        "artwork_url": "https://storage.buzzsprout.com/6gwoqac7kh0ovwwbuev17qujrx5c",
        "description": "<p>Step into the shadowy bamboo groves and misty valleys of Japanese folklore with the Uncanny Coffee Hour as we explore two fascinating supernatural entities—the haunting Nigawari and the mischievous Tanuki.<br><br>The Nigawari, a yokai rarely discussed in Western circles, preys on those who hide their true emotions behind false smiles. Our first tale follows young Hana as she discovers her sister falling under this spirit's influence, teaching us that sometimes the most uncanny horrors are the ones we create within ourselves by refusing to acknowledge our genuine feelings. The parallels to modern mental health discussions are striking—this centuries-old folklore anticipates our contemporary understanding of emotional authenticity and the dangers of toxic positivity.<br><br>From there, we lighten the mood with two delightful Tanuki stories. In the classic tale of Bunbuku Chagama, a shape-shifting raccoon dog becomes a teapot at a monastery, eventually revealing his true nature and remarkable performance skills. Our second Tanuki tale introduces Gengoro, a sake-loving trickster who, during a severe drought, reveals a secret spring to help a village brewer—proving that even the most mischievous creatures can show unexpected kindness.<br><br>Between sips of sake, earl gray tea, and hemp milk espresso, we weave these tales with thoughtful commentary on what they reveal about Japanese culture and universal human experiences. The mixture of humor, folklore, and philosophical musings creates a unique listening experience that will leave you seeing your teapot with new, slightly suspicious eyes.<br><br>Whether you're a folklore enthusiast, a lover of supernatural tales, or simply seeking stories with heart and humor, join us for an episode that reminds us how ancient wisdom continues to illuminate modern life in surprising ways. Subscribe now and remember—not everything that seems ordinary truly is.</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2025-06-07T21:00:00.000-04:00",
        "duration": 2578,
        "hq": false,
        "magic_mastering": false,
        "guid": "Buzzsprout-17298515",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 9,
        "season_number": 1,
        "episode_type": "full",
        "explicit": true,
        "private": false,
        "total_plays": 63
    },
    {
        "id": 17217034,
        "title": "Frozen Vows and Vengeful Spirits: Tales of Yurei part 2",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/17217034-frozen-vows-and-vengeful-spirits-tales-of-yurei-part-2.mp3",
        "artwork_url": "https://storage.buzzsprout.com/04jm0anmkr0vnsgfj3283ek8jhhw",
        "description": "<p>Cold spirits on a spring evening and tales that chill the blood—welcome to a journey through the spectral world of Yurei, the distinctive ghosts of Japanese folklore. Unlike their Western counterparts, these spirits carry their stories visibly in their appearance: white burial robes, trailing black hair, and an unmistakable air of unfinished business.<br><br>The Snow Woman, or Yuki-onna, emerges from the winter mists as one of Japan's most haunting figures. Beautiful yet deadly, she drifts above the snow with skin white as powder and eyes that pierce like ice. Her story weaves together terror and unexpected tenderness—a young woodcutter named Minokichi, spared from her deadly kiss with a warning to never speak of their encounter. Years later, after building a life with his mysteriously beautiful wife Oyuki and their ten children, he breaks his promise. The revelation that follows—that his beloved wife is the very spirit who once spared him—speaks to the complex nature of these supernatural entities who can show both merciless judgment and surprising compassion.<br><br>Equally captivating is the tale of Oiwa, perhaps Japan's most famous vengeful spirit. Betrayed by her ambitious husband who poisoned her face to disfigurement so he could marry a younger, wealthier woman, Oiwa's rage transcended death itself. Her haunting became so complete that her husband was driven to accidentally murder his new bride, seeing Oiwa's disfigured face instead. This story, based on events said to have actually occurred, became a cautionary tale about the consequences of cruelty and betrayal—so powerful that even today, those who tell her story are said to need to pay proper respects lest they invoke her wrath.<br><br>These aren't merely scary stories to send shivers down your spine. They're profound cultural narratives that explore justice, vengeance, and the enduring power of human emotion. They remind us that some promises must never be broken, some betrayals can never be forgiven, and that the departed don't always rest quietly. Subscribe now to hear more uncanny tales from across the world's rich tapestry of folklore and supernatural belief, where ancient wisdom often hides behind the veil of the mysterious.</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2025-05-23T16:00:00.000-04:00",
        "duration": 1782,
        "hq": false,
        "magic_mastering": false,
        "guid": "Buzzsprout-17217034",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 8,
        "season_number": 1,
        "episode_type": "full",
        "explicit": true,
        "private": false,
        "total_plays": 75
    },
    {
        "id": 17133279,
        "title": "The Hairy Holy Man: Navajo Bigfoot part 2",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/17133279-the-hairy-holy-man-navajo-bigfoot-part-2.mp3",
        "artwork_url": "https://storage.buzzsprout.com/x8cm39f0t9nk28mjgu85i9n8mntl",
        "description": "<p>What if everything you thought you knew about Bigfoot was filtered through a colonial lens? Donovan Yazzie, a Diné (Navajo) storyteller, completely transforms our understanding of these forest beings by sharing ancestral knowledge about \"Ye'i Tso\" - what Western culture calls Sasquatch.<br><br>Far from mere campfire tales, Donovan reveals how these beings have been integral to Navajo survival and spiritual understanding. He recounts forgotten histories: a small girl during military persecution who could miraculously gather food because her \"hairy grandpa\" helped her; disabled children left behind during forced relocations who were found years later, thriving under Sasquatch care; and his own wife's aunt who was rescued during a blizzard by a being who still watches over her to this day.<br><br>The conversation transitions from these protective encounters to darker accounts of Sasquatch stalking or chasing people, particularly women gathering piñon nuts. Donovan weaves a complex spiritual tapestry connecting Sasquatch to other phenomena - from skinwalkers and \"little people\" to UFOs - while balancing traditional knowledge with his Christian faith. His upcoming podcast \"Don't Whistle at Night\" aims to create space for Native Americans to share their paranormal experiences.<br><br>A profoundly different understanding emerges: these aren't just elusive creatures but beings with moral agency, individual personalities, and deep connections to indigenous communities spanning centuries. With extraordinary physical capabilities, including 30-foot vertical jumps and tremendous speed, they remain mysterious guardians of a sacred landscape most of us barely comprehend.<br><br>Do you have an uncanny encounter to share? Email us at uncanny.coffee.story@gmail.com—all stories are welcome here, and proof is not required. As we like to say, never whistle at night, and remember: we are not all monsters.</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2025-05-09T18:00:00.000-04:00",
        "duration": 1857,
        "hq": false,
        "magic_mastering": false,
        "guid": "Buzzsprout-17133279",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 7,
        "season_number": 1,
        "episode_type": "full",
        "explicit": true,
        "private": false,
        "total_plays": 110
    },
    {
        "id": 17040621,
        "title": "The Children of the Night: Encounters with Ye'i Tso on Navajo Land",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/17040621-the-children-of-the-night-encounters-with-ye-i-tso-on-navajo-land.mp3",
        "artwork_url": "https://storage.buzzsprout.com/fy0cb40c67xsufzvmw5yehk2wvpg",
        "description": "<p>The veil between our world and the unexplained grows thin as Donovan, a Diné (Navajo) man, leads us into the shadowy realm of Ye'i Tso—the Navajo name for Sasquatch. Growing up in Monument Valley where mystery shrouds the landscape day and night, Donovan's childhood was filled with elders' stories told by firelight in his native language, warnings about what lurks beyond the safety of home after dark.<br><br>With striking clarity, Donovan recounts his unforgettable encounter at age 18 when what he initially thought was a skinwalker revealed itself as something far more primordial. A towering figure with red hair, dome-shaped head, and amber-reflecting eyes stood before him, unleashing vocalizations that defied human capability. The terror escalated when Donovan's young cousin came running back from around a bend, wide-eyed and panicked, having narrowly escaped what he described as a huge orangutan-like creature attempting to grab him.<br><br>What makes this episode truly exceptional is Donovan's cultural insight into the complex relationships between different beings that share the Navajo lands. He explains how skinwalkers actively avoid Sasquatch, how these creatures sometimes helped Navajo people escape from soldiers during times of genocide, and hints at an entire cosmology of interconnected beings from dogmen to entities even more dangerous than Sasquatch itself. Perhaps most chilling is his mention of cave systems containing evidence of victims from throughout history—shoes, clothing, and other remnants of those who ventured too far into the children of the night's domain.<br><br>Whether you're a skeptic or believer, Donovan's testimony offers something rarely found in cryptid discussions: an authentic Indigenous perspective that places these encounters within generations of cultural knowledge. This is just part one of an extraordinary conversation that continues next week—listen now and you might think twice about that nighttime hike you've been planning.</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2025-04-24T23:00:00.000-04:00",
        "duration": 1955,
        "hq": false,
        "magic_mastering": false,
        "guid": "Buzzsprout-17040621",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 6,
        "season_number": 1,
        "episode_type": "full",
        "explicit": false,
        "private": false,
        "total_plays": 97
    },
    {
        "id": 16956811,
        "title": "Stories of Yurei and American Ghosts: ONE",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/16956811-stories-of-yurei-and-american-ghosts-one.mp3",
        "artwork_url": "https://storage.buzzsprout.com/x34jdsnurs9nn5le6vhs6c4im3pk",
        "description": "<p>Have you ever felt a presence watching you from the shadows? That creeping sensation where the rational mind struggles to explain it away, yet something deeper knows you're not alone?&nbsp;<br><br>Ghost stories aren't simply tales we tell in the dark – they represent humanity's oldest attempts to understand what might exist beyond our physical world. From Japanese yurei with their white robes and trailing hair to the vengeful spirits haunting American forests, every culture has developed frameworks to make sense of these encounters.<br><br>This episode takes you deep into firsthand experiences with the unexplained. A Forest Service ranger describes a terrifying encounter with a dark, smoke-like woman reaching into his infant son's crib, followed by night voices from the basement reenacting historical violence. A Marine Corps veteran shares his experience in condemned military housing, frozen in fear as a child's voice begs \"Please don't go.\" And a chilling childhood encounter with a floating \"blue lady\" apparition reminds us that these experiences often begin early in life.<br><br>What makes these stories more than mere entertainment is how they challenge our understanding of reality. Even the most skeptical minds find themselves questioning when confronted with experiences that defy explanation. As Dr K eloquently puts it: \"It doesn't matter if you believe in them... if they believe in you.\"<br><br>Join us as we explore the thin places where worlds bleed together, where the mundane gives way to the marvelous and terrifying. These aren't just ghost stories – they're windows into humanity's eternal questions about what lies beyond and what unfinished business might keep spirits tethered to our world. Have you had your own unexplained encounter? We'd love to hear your story.</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2025-04-11T14:00:00.000-04:00",
        "duration": 1933,
        "hq": false,
        "magic_mastering": false,
        "guid": "Buzzsprout-16956811",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 5,
        "season_number": 1,
        "episode_type": "full",
        "explicit": true,
        "private": false,
        "total_plays": 111
    },
    {
        "id": 16877682,
        "title": "Spooky Silhouettes",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/16877682-spooky-silhouettes.mp3",
        "artwork_url": "https://storage.buzzsprout.com/1ggzlhucfcb95usvwgcrgtjc96sv",
        "description": "<p>The shadows in the corners of your vision aren't always empty. Sometimes they hold secrets, whispers, and things that are best left unseen.<br><br>We've all experienced it—that fleeting dark figure glimpsed from the corner of your eye that vanishes when you turn to look directly at it. Are these merely tricks of the light, or something more sinister? In this captivating episode, we explore the phenomenon of shadow people, those mysterious dark entities that have terrified and fascinated people across cultures for generations.<br><br>Saoirse guides us through the uncanny world of these beings, explaining how they appear in various forms—from wisps of darkness to solid figures with glowing eyes. Some shadow entities seem mindless, drawn to places of darkness and despair, while others demonstrate an unsettling intelligence, watching and waiting with purpose. Most disturbingly, these entities may feed on our emotions, growing stronger with our fear.<br><br>Bob shares his chilling personal encounter with a static-like shadow figure that appeared during a particularly stressful period in his life, leaving him temporarily paralyzed but determined to spiritually defend himself. We also hear from Kristen Parr, who describes encountering the same tall, slender shadow figure on two separate camping trips a year apart, in completely different locations.<br><br>Whether you're a skeptic or a believer, this episode offers fascinating insights into one of the most common yet unexplained paranormal phenomena. Is there more to these experiences than sleep paralysis or tricks of light? Are shadow people manifestations of our own fears, interdimensional travelers, or something else entirely?<br><br>Remember, when you gaze into the darkness, the darkness gazes back. Listen if you dare, and join the conversation about what might be lurking just beyond your peripheral vision.</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2025-03-28T15:00:00.000-04:00",
        "duration": 1684,
        "hq": false,
        "magic_mastering": false,
        "guid": "Buzzsprout-16877682",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 4,
        "season_number": 1,
        "episode_type": "full",
        "explicit": true,
        "private": false,
        "total_plays": 109
    },
    {
        "id": 16787162,
        "title": "Stick Indians",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/16787162-stick-indians.mp3",
        "artwork_url": "https://storage.buzzsprout.com/etpkbc9z0bguv04kashyw9rqnvyw",
        "description": "<p>Ever wondered what a warrior would do when surrounded by stick Indians in thick fog? Or how to keep one away from your lunch?&nbsp; We did! And we've got the answers in our latest episode AND managed to irritate Soairse (again). Join us for the fun and the stories!</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2025-03-13T23:00:00.000-04:00",
        "duration": 1572,
        "hq": false,
        "magic_mastering": false,
        "guid": "Buzzsprout-16787162",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 3,
        "season_number": 1,
        "episode_type": "full",
        "explicit": true,
        "private": false,
        "total_plays": 129
    },
    {
        "id": 16701861,
        "title": "Sasquatch Soft Serve",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/16701861-sasquatch-soft-serve.mp3",
        "artwork_url": "https://storage.buzzsprout.com/jeoi68hsdqaea7m55fmraktqsd9n",
        "description": "<p><b>Welcome back!</b> Today we discuss a tale about a member of a hot shot fire crew in the Pacific Northwest who spots some frightening fleeing fuzzies, meet the new mythical member of the family, and hear 3 stories from <b>Sun Bunny</b> who finds a special gift left in the forest by a grumpy <b>bigfoot</b> who may have had too much fast forest food.&nbsp;</p><p>If you like what we do and have a story to share please contact us at uncanny.coffee.story@gmail.com</p><p>If you want to support us and help us upgrade our audio equipment please visit our patreon <a href=\"https://www.patreon.com/UncannyCoffeeHour\">https://www.patreon.com/UncannyCoffeeHour</a> or the <a href=\"https://www.uncannycoffeepodcast.com/\">website</a> to buy us a coffee.</p>",
        "summary": null,
        "artist": "Dr Kitsune and Odd Bob",
        "tags": "",
        "published_at": "2025-02-27T23:00:00.000-05:00",
        "duration": 1842,
        "hq": false,
        "magic_mastering": false,
        "guid": "Buzzsprout-16701861",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 2,
        "season_number": 1,
        "episode_type": "full",
        "explicit": true,
        "private": false,
        "total_plays": 160
    },
    {
        "id": 16603080,
        "title": "Kitsune",
        "audio_url": "https://www.buzzsprout.com/2450457/episodes/16603080-kitsune.mp3",
        "artwork_url": "https://storage.buzzsprout.com/ph9a2jzeq0gku425vgp0c5nvnthq",
        "description": "<p>We're thrilled to launch our podcast with a journey into the heart of Japanese mythology!&nbsp; Our first episode explores the fascinating story of the Kitsune and the Tiger Bride, a legend that has captivated audiences for centuries.&nbsp; We'll examine some of the characteristics of the shapeshifting Kitsune, the symbolism of the tiger, and the complex relationship between the two main characters.&nbsp; Get to know us as we uncover the significance of this tale and discuss its enduring appeal while becoming a part of the uncanny coffee hour family.</p>",
        "summary": null,
        "artist": "",
        "tags": "",
        "published_at": "2025-02-13T11:00:00.000-05:00",
        "duration": 1834,
        "hq": false,
        "magic_mastering": false,
        "guid": "Buzzsprout-16603080",
        "inactive_at": null,
        "custom_url": "",
        "episode_number": 1,
        "season_number": 1,
        "episode_type": "full",
        "explicit": false,
        "private": false,
        "total_plays": 179
    }
]
